Repository: ZenonEl/TelegramMediaRelayBot
Catalog: Resources/texts.*.resx
Languages: ru_ru

# WaitDownloadingVideo
source: Please wait, the video is being downloaded...
ru_ru: Подождите, идет скачивание видео...

source: What should I do with this?
ru_ru: И что мне с этим делать?

# InvalidLinkFormat
source: What should I do with this? The link format is incorrect.
ru_ru: И что мне с этим делать? Не тот формат ссылки.

# FailedToProcessLink
source: Failed to process the link. Try again later, and if it still doesn't work, the link may not be supported or an error occurred during the video download.
ru_ru: Не удалось обработать ссылку. Попробуйте запрос позже через время, если не помогло — значит ссылка не поддерживается или происходит ошибка на каком то этапе при скачивании видео.

source: Here is your video!
ru_ru: Вот ваше видео!

# ContactSentVideo
source: {0} sent a video! <code>#{1}</code> #{1}_{2} {3}
ru_ru: {0} отправил видео! <code>#{1}</code> #{1}_{2} {3}

source: With text:
ru_ru: С текстом:

# WaitSendingVideo
source: Starting video distribution to users...
ru_ru: Начало рассылки пользователям...

# VideoSuccessfullySent
source: Distribution completed!
ru_ru: Рассылка окончена!

# VideoSentToContacts
source: Video successfully sent to all ({0}) contacts. <code>#{1}</code> #{1}_{2}
ru_ru: Видео успешно отправлено всем ({0}) контактам. <code>#{1}</code> #{1}_{2}

# WaitForUpload
source: Uploading video to Telegram...
ru_ru: Отправка видео в телеграм...

# MutedByContacts
source: You are muted by some contacts ({0}).
ru_ru: Вы находитесь в муте у некоторых контактов ({0}).

# YourLink
source: Your link is for the person who is already using the bot: <code>{0}</code> An invitation link so that a person can start using by bot:
ru_ru: Ваша ссылка для человека что уже пользуется ботом: <code>{0}</code> Пригласительная ссылка чтобы человек мог начать пользоваться ботом:

# VideoDistributionQuestion
source: Who should we send the video to?
ru_ru: Кому будем рассылать видео?

# SendToAllContactsButtonText
source: To all contacts
ru_ru: Всем контактам

# SendToDefaultGroupsButtonText
source: To default groups
ru_ru: Группам по умолчанию

# SendToSpecifiedGroupsButtonText
source: To selected groups only
ru_ru: Только выбранным группам

# SendToSpecifiedUsersButtonText
source: To selected users only
ru_ru: Только выбранным пользователям

# SendOnlyToMeButtonText
source: Only to me
ru_ru: Только мне

# SpecifyContactLink
source: Please provide the person's link:
ru_ru: Укажите ссылку человека:

# NoUserFoundByLink
source: No one was found using this link.
ru_ru: По этой ссылке никто не найден.

# UserFoundByLink
source: One person was found using this link.
ru_ru: По этой ссылке найден один человек.

# ConfirmAdditionText
source: Confirm the addition (otherwise, type /start):
ru_ru: Подтвердите добавление (в противном случае напишите /start):

# WaitForContactConfirmation
source: Now wait for the contact to add you to their list as well.
ru_ru: Теперь ожидайте, когда контакт также добавит вас в свой список.

# UserWantsToAddYou
source: User {0} wants to add you to their contacts.
ru_ru: Пользователь {0} хочет добавить вас в свои контакты.

# NoUserFoundByID
source: No one was found with this ID.
ru_ru: По этому ID никто не найден.

# WillWorkWithContact
source: Shall we work with this contact? ID: {0} Name: {1} ?
ru_ru: Будем работать с этим контактом? ID: {0} Имя: {1} ?

# ConfirmDecision
source: Confirm your decision (otherwise, type /start)
ru_ru: Подтвердите решение (в противном случае напишите /start)

source: Your contacts:
ru_ru: Ваши контакты:

# ContactInfo
source: Contact with ID: {0} Name: {1} Link: <code>{2}</code>
ru_ru: Контакт с ID: {0} Именем: {1} Ссылкой: <code>{2}</code>

# YourInboundInvitations
source: Your incoming invitations:
ru_ru: Ваши входящие приглашения:

# YourOutboundInvitations
source: Your outgoing contact requests:
ru_ru: Ваши запросы на добавление в контакты:

# OutboundInviteMenu
source: Choose an action:
ru_ru: Выберите действие:

# WaitAcceptInboundInvite
source: Are you sure you want to accept the request? (otherwise, type /start)
ru_ru: Вы точно хотите принять запрос? (в противном случае введите команду /start)

# WaitDeclineInboundInvite
source: Are you sure you want to decline the request? (otherwise, type /start)
ru_ru: Вы точно хотите отменить запрос? (в противном случае введите команду /start)

# SelectAction
source: Choose an action for the request:
ru_ru: Выберите действие с запросом:

# DeclineOutBound
source: Are you sure you want to cancel your request to this person?
ru_ru: Вы точно хотите отменить свой запрос к этому человеку?

# ContactGroupInfoText
source: {0} Please specify the group ID for work:
ru_ru: {0} Укажите айди группы для работы:

# AllContactsText
source: List of participants:
ru_ru: Список участников:

# EditContactNameButtonText
source: Change contact name
ru_ru: Изменить имя контакта

# EditContactGroupButtonText
source: Change group composition
ru_ru: Изменить состав групп

# DeleteContactButtonText
source: Delete contact
ru_ru: Удалить контакт

# InputContactIDsText
source: Send the contact ID(s)
ru_ru: Отправьте id контакта(ов)

# ConfirmAddContactsToGroupText
source: Are you sure you want to add these contacts to the group?
ru_ru: Вы точно хотите добавить эти контакты в группу?

# ConfirmDeleteContactsFromGroupText
source: Are you sure you want to remove these contacts from the group?
ru_ru: Вы точно хотите удалить эти контакты из группы?

# AddContactsButtonText
source: Add member(s)
ru_ru: Добавить участника(ов)

# RemoveContactsButtonText
source: Remove member(s)
ru_ru: Удалить участника(ов)

# MuteUserInstructions
source: To mute a person (you won't receive videos from them), you need to provide either their ID or their link.
ru_ru: Чтобы замутить человека (вы не будете получать от него видео) вам нужно указать либо его ID либо его ссылку

# UnmuteUserInstructions
source: To unmute a person (you will receive videos from them again), you need to provide either their ID or their link.
ru_ru: Чтобы размутить человека (вы снова будете получать от него видео) вам нужно указать либо его ID либо его ссылку

# MuteTimeInstructions
source: To convert seconds to other time units, use the following ratios: 1 minute = 60 seconds, 1 hour = 3600 seconds, 1 day = 86400 seconds. Enter the mute time in seconds or a date in the format YYYY-MM-DD HH:MM:SS:
ru_ru: Чтобы перевести секунды в другие единицы времени, используйте следующие соотношения: 1 минута = 60 секунд, 1 час = 3600 секунд, 1 день = 86400 секунд. Введите время мута в секундах или дату в формате ГГГГ-ММ-ДД ЧЧ:ММ:СС:

# UserWillBeUnmuted
source: The user will be unmuted at {0:yyyy-MM-dd HH:mm:ss} (in {1} seconds).
ru_ru: Пользователь будет размучен в {0:yyyy-MM-dd HH:mm:ss} (через {1} секунд).

# UserWillBeUnmutedAt
source: The user will be unmuted at {0:yyyy-MM-dd HH:mm:ss}.
ru_ru: Пользователь будет размучен в {0:yyyy-MM-dd HH:mm:ss}.

# UserWillBeMutedIndefinitely
source: The user will be muted indefinitely.
ru_ru: Пользователь будет замучен бессрочно.

# InvalidMuteTimeFormat
source: Please enter the mute time in seconds or a date in the format YYYY-MM-DD HH:MM:SS. Or type 'Indefinitely'.
ru_ru: Пожалуйста, введите время мута в секундах или дату в формате ГГГГ-ММ-ДД ЧЧ:ММ:СС. Или напишите 'Бессрочно'.

# ConfirmFinalDecision
source: Review your decision and confirm it if you are sure this is what you need (otherwise, type /start)
ru_ru: Проверьте своё решение и подтвердите его, если вы уверены, что это то, что вам нужно (в противном случае напишите /start)

# MuteSet
source: Mute has been set.
ru_ru: Мут установлен.

# UserInMute
source: The user is muted until: {0} Are you sure you want to unmute them? If not, type /start
ru_ru: Пользователь находится в муте до: {0} Вы действительно хотите его размутить? Если нет, то напишите /start

# NoActiveMute
source: The contact is not currently muted.
ru_ru: Контакт сейчас не находится в состоянии мута

# UserUnmuted
source: The user has been unmuted.
ru_ru: Пользователь размучен.

# IndefinitelyButtonText
source: Indefinitely
ru_ru: Бессрочно

# PleaseEnterContactIDs
source: Please enter one or more contact IDs separated by spaces.
ru_ru: Пожалуйста, введите один или несколько ID контактов, разделенных пробелами.

# InvalidInputNumbers
source: Invalid input. Please enter numbers separated by spaces.
ru_ru: Некорректный ввод. Пожалуйста, введите числа, разделенные пробелами.

# ConfirmRemovalMessage
source: Are you sure you want to remove the following users from your contacts?
ru_ru: Вы уверены, что хотите удалить следующих пользователей из ваших контактов?

# NoUsersFound
source: No users found with the provided IDs.
ru_ru: Пользователи с указанными ID не найдены.

source: Removal process completed.
ru_ru: Процесс удаления завершен.

# NextButtonText
source: Next
ru_ru: Дальше

# LinkText
source: Link
ru_ru: Ссылка

# NameText
source: Name
ru_ru: Имя

# YesButtonText
source: Yes
ru_ru: Да

# NoButtonText
source: No
ru_ru: Нет

# BackButtonText
source: Back to menu
ru_ru: Назад в меню

# MuteUserButtonText
source: Mute user
ru_ru: Замутить пользователя

# UnmuteUserButtonText
source: Unmute user
ru_ru: Размутить пользователя

# AddContactButtonText
source: Add contact
ru_ru: Добавить контакт

# MyLinkButtonText
source: My link
ru_ru: Моя ссылка

# ViewInboundInvitesButtonText
source: View incoming contact requests
ru_ru: Обзор входящих заявок

# ViewOutboundInvitesButtonText
source: View my outgoing contact requests
ru_ru: Обзор исходящих заявок

# ViewAllContactsButtonText
source: View all my contacts
ru_ru: Обзор всех моих контактов

# UsersGroupButtonText
source: View all my groups
ru_ru: Обзор всех моих групп

# BehindTheScenesButtonText
source: Behind the scenes
ru_ru: Заглянуть за кулисы

# ChooseOptionText
source: Choose an option:
ru_ru: Выберите опцию:

# AcceptButtonText
source: Accept contact request
ru_ru: Принять заявку на добавление

# DeclineButtonText
source: Decline contact request
ru_ru: Отменить заявку на добавление

# YourGroupsText
source: Your contact groups:
ru_ru: Ваши группы контактов:

# AltYourGroupsText
source: You have no groups yet.
ru_ru: У вас пока нет групп.

# SettingsButtonText
source: Settings
ru_ru: Настройки

# AutoSendTimeChangedMessage
source: Video send time changed to
ru_ru: Время отправки видео изменено на

# AutoSendTimeNotChangedMessage
source: Video send time not changed.
ru_ru: Время отправки видео не изменено.

# DefaultActionChangedMessage
source: Default action successfully changed.
ru_ru: Действие по умолчанию успешно изменено.

# DefaultActionNotChangedMessage
source: Default action not changed.
ru_ru: Действие по умолчанию не изменено.

# DefaultActionTimeoutMessage
source: ⏳ Time is up, the default action will be performed...
ru_ru: ⏳ Время вышло, будет выполнено действие по умолчанию...

# SettingsMenuText
source: Available settings:
ru_ru: Доступные настройки:

# DefaultActionsMenuText
source: Available default actions:
ru_ru: Доступные действия по умолчанию:

# VideoDefaultActionsMenuText
source: Available actions for configuring default actions when processing links:
ru_ru: Доступные действия для настройки действий по умолчанию при обработке ссылок:

# UsersVideoSentUsersMenuText
source: Available actions for configuring default distribution:
ru_ru: Доступные действия для настройки рассылки по умолчанию:

# AutoSendVideoTimeMenuText
source: Available actions for configuring default distribution:
ru_ru: Доступные настройки для ожидания, перед рассылкой по умолчанию:

# DefaultActionsButtonText
source: Default Actions
ru_ru: Действия по умолчанию

# PrivacyButtonText
source: Privacy
ru_ru: Приватность

# DefaultVideoActionsButtonText
source: Default Actions for Video Distribution
ru_ru: Действия по умолчанию для рассылки видео

# VideoRecipientsButtonText
source: Video Recipients
ru_ru: Кому рассылать видео

# AutoSendTimeButtonText
source: Auto-Send Time
ru_ru: Время авто-отправки видео

# AllContactsButtonText
source: All Contacts
ru_ru: Всем контактам

# DefaultGroupsButtonText
source: Default Groups
ru_ru: Группам по умолчанию

# SpecifiedContactsButtonText
source: Specified Contacts
ru_ru: Выбранным контактам

# SpecifiedGroupsButtonText
source: Specified Groups
ru_ru: Выбранным группам

# OnlyMeButtonText
source: Only Me
ru_ru: Только мне

# DisableAutoSendButtonText
source: Disable Auto-Send
ru_ru: Выключить авто-рассылку

# FiveSecondsButtonText
source: 5 Seconds
ru_ru: 5 секунд

# TenSecondsButtonText
source: 10 Seconds
ru_ru: 10 секунд

# ThirtySecondsButtonText
source: 30 Seconds
ru_ru: 30 секунд

# OneMinuteButtonText
source: 1 Minute
ru_ru: 1 минута

# TenMinutesButtonText
source: 10 Minutes
ru_ru: 10 минут

# SixtyMinutesButtonText
source: 60 Minutes
ru_ru: 60 минут

# CreateGroupButtonText
source: Create a new group
ru_ru: Создать новую группу

# EditGroupButtonText
source: Edit group
ru_ru: Редактировать группу

# NewGroupText
source: Come up with a group name and send it to me:
ru_ru: Придумайте название группы и отправьте его мне:

# EditInputText
source: Send me the group ID for editing:
ru_ru: Напиши мне айди группы для редактирования:

# DeleteInputText
source: Send me the group ID for deletion:
ru_ru: Напишите мне айди группы для удаления:

# NewGroupNameText
source: Send me the new group name:
ru_ru: Напиши мне новое название группы:

# NewGroupDescriptionText
source: Send me the new group description:
ru_ru: Напиши мне новое описание группы:

# ChangeNameText
source: Change name
ru_ru: Поменять название

# ChangeDescriptionText
source: Change description
ru_ru: Поменять описание

# ChangeIsDefaultEnabledText
source: Toggle default value
ru_ru: Переключить значение по умолчанию

# DeleteGroupButtonText
source: Delete group
ru_ru: Удалить группу

# GroupInfoText
source: 📌 <b>Name:</b> {0} 🆔 <b>ID:</b> {1} 📝 <b>Description:</b> {2} 👥 <b>Members:</b> {3} 🌟 <b>Default mailing:</b> {4} ----------------------------------------------------
ru_ru: 📌 <b>Название:</b> {0} 🆔 <b>ID:</b> {1} 📝 <b>Описание:</b> {2} 👥 <b>Участников:</b> {3} 🌟 <b>Рассылка по умолчанию:</b> {4} ----------------------------------------------------

# HelpText
source: 🌐 <b>Adding contacts — creating our own mini digital network</b> As connect members of your media circle: 1. 🔄 <b>Initiate communication</b> Send the `/start` command and click the "Add contact" button in the menu. → The bot will request a unique link from a user like: `1234ab56-cde-78fg-01hi-2j34k56790` 2. <b>🔗 Exchange of identifiers</b> - Your link can be found in the "My link" section. - Pass it on to future contacts, for example, via a QR code or a private message. 3. <b>🤝 Contact confirmation</b> - Paste the received link into the input field and send it to the bot. - If everything is correct, you will see a short user profile. 4. <b> ⏳ Waiting for a response</b> - Your request will be sent to the recipient, he will receive a notification. - When he accepts the invitation (through the "Review incoming applications" section), you can start sharing content with each other. <b>And don't be afraid to use groups: Contacts can and should be grouped into different groups: `Colleagues', `Friends', `Society of Lovers birds 🐦️' — for point distribution to multiple contacts at once.</b> --- <b>🚀 Downloading and forwarding content is a three—step magic steps</b> 📥 Working with links Just send the bot <b>a link + description (if necessary and necessarily from a new line)</b> in format: <pre>https://youtu.be/ваше_супер_видео Take a look at this cosmic dance of the northern lights! 🌌 #nature #wow </pre> <b>If you use the description, then you must start from a new line!</b> → The bot will do the rest: 1. It will determine the platform, whether it's YouTube, TikTok, Instagram, or any other service. 2. Downloads the content in optimal quality (with the ability to adjust to your preferences in the configuration). 3. It will forward the video exactly there and to those who need it. ✨ 🔄 Automatic mailing list - Your file will be instantly sent to all specified contacts from your list. Conditions: Contacts must be with you are on the list. You should not be in the mud at these contacts. The mailing list parameters must be configured correctly. <b>Advice: Use hashtags in the description!</b> This will allow you to easily find content in your chat history. For example, search by tags #cats or #work_folk. The built—in hashtags also work, but their own ones are more convenient and personalized. --- ✨ <b>The project is constantly evolving:</b> New features are popping up like mushrooms after the rain! 🍄 To keep up to date with all updates and not Skip anything important: - <b>Subscribe to my account</b> in <a href="https://mastodon.ml/@ZenonEl ">Mastodon</a>. - Or just ask for news from the one who invited you to this fascinating digital media cycle! 😉 🔗 Supported platforms can be found here The bot works with 1000+ sources thanks to the integration of <b>yt-dlp</b> — full list <a href="https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites.md">here</a>. <b>Maybe in the future:</b> Integration with <b>Gallery-dl</b> for downloading entire galleries and archives!
ru_ru: 🌐 <b>Добавление контактов — создаём свою мини цифровую сеть</b> Как подключить участников вашего медиа-круга: 1. 🔄 <b>Инициируйте связь</b> Отправьте команду `/start` и нажмите кнопку «Добавить контакт» в меню. → Бот запросит <b>уникальную ссылку</b> пользователя вида: `1234ab56-cde-78fg-01hi-2j34k56790` 2. <b>🔗 Обмен идентификаторами</b> - Вашу ссылку можно найти в разделе «Моя ссылка». - Передайте её будущим контактам — например, через QR-код или личное сообщение. 3. <b>🤝 Подтверждение контакта</b> - Вставьте полученную ссылку в поле ввода и отправьте её боту. - Если всё верно — увидите краткий профиль пользователя. 4. <b>⏳ Ожидание ответа</b> - Ваш запрос отправится адресату, он получит уведомление. - Когда он примет приглашение (через раздел «Обзор входящих заявок») вы сможете начать обмениваться контентом друг с другом. <b>И не бойтесь пользоваться группами: Контакты можно и нужно группировать по разным группам: `Коллеги`, `Друзья`, `Общество любителей птичек 🐦‍⬛️` — для точечной рассылки сразу множеству контактов за раз.</b> --- <b>🚀 Скачивание и пересылка контента — магия в три шага</b> 📥 Работа с ссылками Просто отправьте боту <b>ссылку + описание (если нужно и обязательно с новой строки)</b> в формате: <pre>https://youtu.be/ваше_супер_видео Взгляните на этот космический танец северного сияния! 🌌 #природа #wow </pre> <b>Если используете описание, то обязательно с новой строки!</b> → Бот сделает всё остальное: 1. Определит платформу — будь то YouTube, TikTok, Instagram или любой другой сервис. 2. Скачает контент в оптимальном качестве (с возможностью настройки под ваши предпочтения в конфигурации). 3. Перешлет видео именно туда и тем, кому нужно. ✨ 🔄 Автоматическая рассылка - Ваш файл мгновенно поступит всем указанным контактам из вашего списка. Условия: Контакты должны быть у вас в списке. Вы не должны находиться в муте у этих контактов. Параметры рассылки должны быть настроены корректно. <b>Совет: Используйте хештеги в описании!</b> Это позволит вам легко находить контент в истории чатов. Например, ищите по тегам #котики или #работа_не_волк. Встроенные хештеги тоже работают, но свои — удобнее и персонализированнее. --- ✨ <b>Проект постоянно развивается:</b> новые функции появляются как грибы после дождя! 🍄 Чтобы быть в курсе всех обновлений и не пропустить ничего важного: - <b>Подпишитесь на мой аккаунт</b> в <a href="https://mastodon.ml/@ZenonEl">Mastodon</a>. - Или просто интересуйтесь новостями у того, кто пригласил вас в этот увлекательный цифровой круговорот медиа! 😉 🔗 Поддерживаемые платформы можно найти тут Бот работает с 1000+ источников благодаря интеграции <b>yt-dlp</b> — полный список <a href="https://github.com/yt-dlp/yt-dlp/blob/master/supportedsites.md">здесь</a>. <b>Возможно в будущем:</b> интеграция с <b>gallery-dl</b> для скачивания целых галерей и архивов!

# GroupHelpText
source: Just send me the command: /link [video_link] PS: The square brackets are not needed :)
ru_ru: Просто отправь мне команду: /link [ссылка_на_тт_видео] PS: квадратные скобки не нужны :)

# WhosTheGeniusText
source: Hello everyone! I'm ZenonEl, the creator of this bag of code and algorithms. My GitHub: https://github.com/ZenonEl/ The idea for this bot came to me when, once again, my friends had to manually send me TikTok videos (which I don't use) by downloading them, sending them, and then deleting them from their phones... So, I thought it would be great to simplify all these monotonous actions for them and decided to create this bot. Now, thanks to it, I can run a simple bot on my PC, set up a list of contacts from whom I want to receive videos, and that's it—making life easier for both myself and my friends. Convenient! Enjoy using it!
ru_ru: Всем привет! Я, ZenonEl, создатель этого мешка с кодом и алгоритмами. Мой GitHub: https://github.com/ZenonEl/ Идея создания этого бота возникла у меня, когда в очередной раз мои знакомые были вынуждены присылать видео с Тик Тока (которым я не пользуюсь) вручную (скачивая его и отправляя... потом удаляя видео с телефона...). В общем, и я подумал, что было бы здорово облегчить все эти монотонные действия для них и решил создать этого самого бота. Теперь благодаря ему я могу запустить простого бота хоть у себя на ПК. Выставить список контактов от кого я хочу получать видосики и всё, облегчил жизнь и себе, и своим знакомым. Удобно! Приятного пользования!

# AccessDeniedMessage
source: At the moment, new users have limited access to the bot.
ru_ru: В данный момент, новым пользователям, доступ к боту ограничен.

# InputErrorMessage
source: An error occurred, please make sure you entered valid data
ru_ru: Произошла ошибка, убедитесь что вы ввели корректные данные

# SuccessActionResult
source: The action was successfully completed
ru_ru: Действие было успешно выполнено

# ErrorActionResult
source: The action was (fully/partially) not completed
ru_ru: Действие (полностью/частично) не было выполнено
